In [1]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

C:\Users\sltsi\AppData\Local\Temp\ipykernel_19516\4272357637.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
hiringdf=pd.read_csv('hiring.csv')
print(hiringdf)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
print(hiringdf.to_string())

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
print(hiringdf.shape)

(8, 4)

In [5]:
print(hiringdf.isna().sum())

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [8]:
hiringdf['experience'] = hiringdf['experience'].fillna('zero')
hiringdf

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [10]:
from word2number import w2n
hiringdf['experience'] = hiringdf['experience'].apply(w2n.word_to_num)
hiringdf

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [12]:
mean=hiringdf['test_score(out of 10)'].mean()
print(mean)

7.857142857142857

In [13]:
hiringdf['test_score(out of 10)']=hiringdf['test_score(out of 10)'].fillna(mean)
print(hiringdf)

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [14]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [15]:
X=hiringdf.drop(columns=['salary($)'])
Y=hiringdf['salary($)']

In [17]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.2)

In [18]:
print(X_train.shape)
print(X_test.shape)

(6, 3)
(2, 3)

In [19]:
print(Y_train.shape)
print(Y_test.shape)

(6,)
(2,)

In [20]:
model=LinearRegression()
model.fit(X_train,Y_train)
ans=model.predict(X_test)
print(ans)

[61555.17368556 78687.02811242]

In [ ]:
n=int(input("Enter n"))
for i in range(n):
    expe=int(input("Enter Experience:"))
    test=int(input("Enter testscore:"))
    inte=int(input("Enter score:"))
    ans=model.predict([[expe,test,inte]])
    print(ans)

Enter n 3
Enter Experience: 4
Enter testscore: 7
Enter score: 88

[203779.36015427]